sources/day_03/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// *** Air @ 20C ***
rho     [1 -3 0 0 0 0 0] 1.2;
nu      [0 2 -1 0 0 0 0] 1.5e-05; // kinematic viscosity
DT   DT [0 2 -1 0 0 0 0] 1.85e-06; // thermal diffusivity

// *** Water @ 20C***
//rho     [1 -3 0 0 0 0 0] 1000;
//nu      [0 2 -1 0 0 0 0] 1e-06; // kinematic viscosity
//DT   DT [0 2 -1 0 0 0 0] 1.46e-07; // thermal diffusivity

// ************************************************************************* //
