sources/day_03/case/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 293;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 293;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    hot_wall
    {
        type            fixedValue;
        value           uniform 373;
    }
    
    wall
    {
        type            zeroGradient;
    }
    
    emptyFaces
    {
        type           empty;
    }
}


// ************************************************************************* //
